import React from "react"

export const Guide = () => {
    return (
        <main className="guide">
            <h1>Гайд по сайту</h1>
            <p>Ща проясню чо и куда</p>
            <p>Сайт пока очень не доработанный, но основные функции выполняет. Проверочная книга уже залита - "Чернокнижник в мире магии".</p>
            <h3>Про страницы, которые можно выбрать справа</h3>
            <p>All books - это место, где будут отображаться все книги. Чтобы добавить книгу, нужно будет отправить файлик (формат fb2 или просто название, сам поищу) мне и я добавлю, потому что кнопка добавления (плюсик) не робит правильно. В будущем это исправится.</p>
            <p>Favorite - это место, где будут отображаться только любимые книги. Пока что нельзя добавить книгу в избранное. В будущем это исправится.</p>
            <p>Genres - это место, где будут отображаться книги по категориям. Пока что нельзя добавить книге категорию. В будущем это исправится.</p>
            <h3>Самое крутое преймущество моего сайта</h3>
            <p>Если что-то не нравится или не работает - пишешь мне и я меняю.</p>
            <h3>Основные планы на сайт</h3>
            <p>1. Сохранение закладки</p>
            <p>2. Добавление книге категории</p>
            <p>3. Добавление книги в избранное</p>
            <p>4. Создание темной темы</p>
        </main>
    )
}